// Задача 42: Напишите программу, которая будет преобразовывать десятичное число в двоичное.
// 45 -> 101101
// 3  -> 11
// 2  -> 10

Console.WriteLine("Введите число - ");
int size = int string.Length;
int N = Convert.ToInt32(Console.ReadLine());
if (N<=0) Array
while (N > 0)
{
    int lastNum = N %
}